beaker/results/mysql-b.txt
Adding shard node URL: jdbc:mysql://127.0.0.1:3306/ycsb?serverTimezone=UTC
Using shards: 1, batchSize:1000, fetchSize: 10
[OVERALL], RunTime(ms), 1701
[OVERALL], Throughput(ops/sec), 587.8894767783656
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 936
[READ], AverageLatency(us), 856.1346153846154
[READ], MinLatency(us), 200
[READ], MaxLatency(us), 16911
[READ], 95thPercentileLatency(us), 2147
[READ], 99thPercentileLatency(us), 5859
[READ], Return=OK, 936
[READ], 200, 1.0
[READ], 221, 1.0
[READ], 235, 1.0
[READ], 240, 1.0
[READ], 241, 1.0
[READ], 244, 1.0
[READ], 248, 1.0
[READ], 250, 1.0
[READ], 252, 1.0
[READ], 254, 1.0
[READ], 256, 1.0
[READ], 258, 1.0
[READ], 259, 1.0
[READ], 263, 1.0
[READ], 266, 2.0
[READ], 270, 1.0
[READ], 271, 1.0
[READ], 273, 2.0
[READ], 274, 1.0
[READ], 275, 1.0
[READ], 276, 1.0
[READ], 277, 3.0
[READ], 279, 3.0
[READ], 280, 2.0
[READ], 284, 2.0
[READ], 285, 1.0
[READ], 286, 1.0
[READ], 287, 2.0
[READ], 288, 2.0
[READ], 289, 1.0
[READ], 290, 1.0
[READ], 292, 1.0
[READ], 293, 1.0
[READ], 295, 3.0
[READ], 297, 2.0
[READ], 298, 2.0
[READ], 299, 1.0
[READ], 300, 5.0
[READ], 301, 2.0
[READ], 302, 5.0
[READ], 303, 1.0
[READ], 304, 4.0
[READ], 305, 4.0
[READ], 306, 1.0
[READ], 307, 1.0
[READ], 308, 1.0
[READ], 310, 3.0
[READ], 311, 4.0
[READ], 314, 1.0
[READ], 315, 3.0
[READ], 316, 1.0
[READ], 317, 1.0
[READ], 318, 3.0
[READ], 319, 2.0
[READ], 320, 4.0
[READ], 322, 1.0
[READ], 323, 3.0
[READ], 324, 4.0
[READ], 325, 2.0
[READ], 326, 3.0
[READ], 327, 1.0
[READ], 329, 1.0
[READ], 330, 3.0
[READ], 331, 4.0
[READ], 332, 2.0
[READ], 333, 2.0
[READ], 334, 1.0
[READ], 335, 1.0
[READ], 337, 1.0
[READ], 338, 2.0
[READ], 339, 1.0
[READ], 340, 2.0
[READ], 341, 3.0
[READ], 342, 2.0
[READ], 345, 1.0
[READ], 346, 2.0
[READ], 347, 1.0
[READ], 348, 1.0
[READ], 350, 1.0
[READ], 351, 1.0
[READ], 352, 1.0
[READ], 353, 2.0
[READ], 354, 1.0
[READ], 355, 1.0
[READ], 356, 1.0
[READ], 357, 4.0
[READ], 358, 4.0
[READ], 359, 1.0
[READ], 362, 2.0
[READ], 364, 2.0
[READ], 366, 3.0
[READ], 367, 1.0
[READ], 370, 2.0
[READ], 371, 3.0
[READ], 372, 1.0
[READ], 374, 3.0
[READ], 375, 2.0
[READ], 377, 1.0
[READ], 379, 3.0
[READ], 380, 1.0
[READ], 381, 3.0
[READ], 382, 4.0
[READ], 384, 2.0
[READ], 385, 3.0
[READ], 386, 2.0
[READ], 387, 1.0
[READ], 388, 2.0
[READ], 389, 1.0
[READ], 391, 2.0
[READ], 392, 1.0
[READ], 393, 2.0
[READ], 394, 1.0
[READ], 395, 1.0
[READ], 396, 2.0
[READ], 397, 1.0
[READ], 400, 1.0
[READ], 401, 1.0
[READ], 403, 1.0
[READ], 404, 1.0
[READ], 405, 1.0
[READ], 406, 3.0
[READ], 407, 3.0
[READ], 408, 1.0
[READ], 409, 1.0
[READ], 410, 4.0
[READ], 412, 1.0
[READ], 413, 1.0
[READ], 414, 3.0
[READ], 415, 2.0
[READ], 416, 1.0
[READ], 417, 3.0
[READ], 421, 3.0
[READ], 422, 1.0
[READ], 423, 3.0
[READ], 424, 1.0
[READ], 425, 1.0
[READ], 428, 1.0
[READ], 429, 3.0
[READ], 430, 3.0
[READ], 432, 2.0
[READ], 434, 1.0
[READ], 436, 2.0
[READ], 437, 3.0
[READ], 439, 1.0
[READ], 440, 3.0
[READ], 442, 1.0
[READ], 443, 1.0
[READ], 444, 2.0
[READ], 446, 3.0
[READ], 447, 2.0
[READ], 449, 1.0
[READ], 451, 1.0
[READ], 453, 1.0
[READ], 454, 5.0
[READ], 455, 2.0
[READ], 456, 3.0
[READ], 457, 2.0
[READ], 458, 3.0
[READ], 459, 2.0
[READ], 460, 1.0
[READ], 461, 3.0
[READ], 462, 1.0
[READ], 463, 2.0
[READ], 464, 2.0
[READ], 466, 2.0
[READ], 467, 2.0
[READ], 468, 1.0
[READ], 469, 2.0
[READ], 470, 1.0
[READ], 471, 1.0
[READ], 472, 1.0
[READ], 473, 5.0
[READ], 474, 1.0
[READ], 475, 3.0
[READ], 477, 3.0
[READ], 480, 3.0
[READ], 481, 1.0
[READ], 482, 2.0
[READ], 483, 1.0
[READ], 485, 2.0
[READ], 486, 2.0
[READ], 488, 2.0
[READ], 489, 1.0
[READ], 490, 2.0
[READ], 491, 1.0
[READ], 493, 2.0
[READ], 495, 1.0
[READ], 497, 4.0
[READ], 498, 1.0
[READ], 499, 2.0
[READ], 500, 1.0
[READ], 503, 2.0
[READ], 504, 1.0
[READ], 505, 3.0
[READ], 506, 1.0
[READ], 508, 1.0
[READ], 509, 3.0
[READ], 510, 1.0
[READ], 511, 1.0
[READ], 512, 4.0
[READ], 513, 1.0
[READ], 514, 2.0
[READ], 515, 1.0
[READ], 516, 1.0
[READ], 518, 1.0
[READ], 519, 1.0
[READ], 520, 1.0
[READ], 521, 1.0
[READ], 522, 1.0
[READ], 523, 1.0
[READ], 524, 2.0
[READ], 525, 3.0
[READ], 526, 1.0
[READ], 527, 6.0
[READ], 529, 2.0
[READ], 530, 3.0
[READ], 531, 3.0
[READ], 532, 2.0
[READ], 533, 3.0
[READ], 534, 1.0
[READ], 535, 2.0
[READ], 536, 1.0
[READ], 537, 3.0
[READ], 540, 3.0
[READ], 541, 2.0
[READ], 542, 1.0
[READ], 543, 2.0
[READ], 545, 3.0
[READ], 546, 1.0
[READ], 547, 3.0
[READ], 548, 1.0
[READ], 549, 1.0
[READ], 551, 2.0
[READ], 552, 3.0
[READ], 553, 1.0
[READ], 556, 1.0
[READ], 557, 1.0
[READ], 558, 1.0
[READ], 559, 3.0
[READ], 560, 2.0
[READ], 563, 1.0
[READ], 564, 1.0
[READ], 565, 1.0
[READ], 566, 1.0
[READ], 567, 1.0
[READ], 569, 1.0
[READ], 570, 1.0
[READ], 571, 2.0
[READ], 572, 3.0
[READ], 573, 2.0
[READ], 574, 1.0
[READ], 576, 2.0
[READ], 577, 2.0
[READ], 578, 3.0
[READ], 579, 3.0
[READ], 580, 1.0
[READ], 581, 1.0
[READ], 582, 2.0
[READ], 584, 4.0
[READ], 585, 1.0
[READ], 586, 1.0
[READ], 587, 2.0
[READ], 590, 1.0
[READ], 593, 2.0
[READ], 594, 1.0
[READ], 595, 3.0
[READ], 596, 1.0
[READ], 597, 1.0
[READ], 598, 2.0
[READ], 599, 1.0
[READ], 602, 1.0
[READ], 603, 1.0
[READ], 604, 1.0
[READ], 605, 2.0
[READ], 608, 1.0
[READ], 609, 1.0
[READ], 610, 4.0
[READ], 612, 2.0
[READ], 615, 1.0
[READ], 617, 3.0
[READ], 618, 2.0
[READ], 623, 2.0
[READ], 624, 1.0
[READ], 625, 6.0
[READ], 626, 1.0
[READ], 630, 2.0
[READ], 631, 1.0
[READ], 632, 1.0
[READ], 634, 3.0
[READ], 638, 2.0
[READ], 640, 1.0
[READ], 641, 2.0
[READ], 643, 1.0
[READ], 644, 1.0
[READ], 646, 3.0
[READ], 647, 2.0
[READ], 648, 1.0
[READ], 649, 2.0
[READ], 650, 1.0
[READ], 651, 2.0
[READ], 652, 1.0
[READ], 653, 1.0
[READ], 655, 2.0
[READ], 657, 2.0
[READ], 660, 1.0
[READ], 661, 1.0
[READ], 662, 1.0
[READ], 663, 1.0
[READ], 666, 2.0
[READ], 667, 1.0
[READ], 668, 1.0
[READ], 670, 3.0
[READ], 671, 2.0
[READ], 672, 1.0
[READ], 673, 1.0
[READ], 676, 1.0
[READ], 677, 3.0
[READ], 678, 4.0
[READ], 681, 1.0
[READ], 682, 1.0
[READ], 684, 3.0
[READ], 687, 1.0
[READ], 688, 3.0
[READ], 690, 2.0
[READ], 691, 1.0
[READ], 692, 2.0
[READ], 693, 1.0
[READ], 695, 1.0
[READ], 696, 1.0
[READ], 697, 3.0
[READ], 698, 1.0
[READ], 701, 1.0
[READ], 703, 3.0
[READ], 707, 1.0
[READ], 709, 1.0
[READ], 710, 1.0
[READ], 711, 1.0
[READ], 712, 1.0
[READ], 714, 1.0
[READ], 716, 3.0
[READ], 720, 1.0
[READ], 721, 1.0
[READ], 722, 3.0
[READ], 723, 1.0
[READ], 725, 1.0
[READ], 729, 2.0
[READ], 733, 1.0
[READ], 734, 1.0
[READ], 736, 2.0
[READ], 739, 2.0
[READ], 740, 1.0
[READ], 741, 2.0
[READ], 744, 2.0
[READ], 749, 2.0
[READ], 754, 2.0
[READ], 756, 1.0
[READ], 757, 1.0
[READ], 758, 1.0
[READ], 759, 1.0
[READ], 761, 1.0
[READ], 763, 1.0
[READ], 769, 1.0
[READ], 770, 2.0
[READ], 774, 2.0
[READ], 775, 1.0
[READ], 777, 1.0
[READ], 778, 1.0
[READ], 779, 1.0
[READ], 780, 2.0
[READ], 781, 1.0
[READ], 782, 3.0
[READ], 788, 1.0
[READ], 789, 1.0
[READ], 791, 1.0
[READ], 797, 1.0
[READ], 798, 1.0
[READ], 804, 2.0
[READ], 807, 1.0
[READ], 808, 1.0
[READ], 816, 1.0
[READ], 817, 1.0
[READ], 819, 1.0
[READ], 820, 1.0
[READ], 823, 1.0
[READ], 826, 3.0
[READ], 830, 1.0
[READ], 834, 4.0
[READ], 835, 2.0
[READ], 838, 3.0
[READ], 839, 1.0
[READ], 840, 1.0
[READ], 844, 1.0
[READ], 851, 1.0
[READ], 858, 2.0
[READ], 859, 1.0
[READ], 860, 2.0
[READ], 861, 2.0
[READ], 866, 2.0
[READ], 867, 1.0
[READ], 869, 1.0
[READ], 870, 2.0
[READ], 872, 1.0
[READ], 876, 1.0
[READ], 877, 1.0
[READ], 878, 1.0
[READ], 880, 1.0
[READ], 882, 1.0
[READ], 883, 1.0
[READ], 885, 3.0
[READ], 887, 1.0
[READ], 892, 2.0
[READ], 893, 1.0
[READ], 894, 1.0
[READ], 895, 2.0
[READ], 897, 4.0
[READ], 900, 2.0
[READ], 901, 1.0
[READ], 906, 3.0
[READ], 909, 1.0
[READ], 913, 1.0
[READ], 915, 1.0
[READ], 918, 1.0
[READ], 919, 2.0
[READ], 920, 2.0
[READ], 924, 1.0
[READ], 928, 1.0
[READ], 929, 1.0
[READ], 930, 1.0
[READ], 931, 1.0
[READ], 933, 1.0
[READ], 937, 1.0
[READ], 938, 1.0
[READ], 940, 1.0
[READ], 949, 1.0
[READ], 952, 1.0
[READ], 960, 1.0
[READ], 963, 1.0
[READ], 977, 2.0
[READ], 978, 1.0
[READ], 980, 1.0
[READ], 983, 1.0
[READ], 984, 1.0
[READ], 989, 2.0
[READ], 997, 1.0
[READ], 1000, 1.0
[READ], 1006, 1.0
[READ], 1007, 1.0
[READ], 1008, 1.0
[READ], 1013, 1.0
[READ], 1014, 1.0
[READ], 1018, 1.0
[READ], 1019, 1.0
[READ], 1021, 2.0
[READ], 1041, 1.0
[READ], 1047, 1.0
[READ], 1049, 2.0
[READ], 1061, 1.0
[READ], 1073, 2.0
[READ], 1087, 1.0
[READ], 1089, 1.0
[READ], 1091, 1.0
[READ], 1095, 1.0
[READ], 1102, 1.0
[READ], 1115, 1.0
[READ], 1119, 2.0
[READ], 1130, 1.0
[READ], 1132, 1.0
[READ], 1139, 1.0
[READ], 1146, 1.0
[READ], 1147, 2.0
[READ], 1150, 1.0
[READ], 1152, 1.0
[READ], 1160, 1.0
[READ], 1161, 1.0
[READ], 1165, 1.0
[READ], 1168, 1.0
[READ], 1176, 1.0
[READ], 1185, 1.0
[READ], 1190, 1.0
[READ], 1213, 1.0
[READ], 1214, 2.0
[READ], 1215, 1.0
[READ], 1220, 1.0
[READ], 1221, 1.0
[READ], 1227, 1.0
[READ], 1233, 1.0
[READ], 1239, 3.0
[READ], 1247, 1.0
[READ], 1253, 1.0
[READ], 1261, 1.0
[READ], 1270, 2.0
[READ], 1272, 1.0
[READ], 1275, 1.0
[READ], 1282, 1.0
[READ], 1298, 1.0
[READ], 1299, 1.0
[READ], 1309, 1.0
[READ], 1310, 1.0
[READ], 1321, 1.0
[READ], 1323, 1.0
[READ], 1328, 1.0
[READ], 1343, 1.0
[READ], 1351, 1.0
[READ], 1354, 1.0
[READ], 1355, 1.0
[READ], 1357, 1.0
[READ], 1359, 1.0
[READ], 1369, 1.0
[READ], 1370, 1.0
[READ], 1371, 1.0
[READ], 1375, 1.0
[READ], 1379, 1.0
[READ], 1384, 1.0
[READ], 1403, 1.0
[READ], 1413, 1.0
[READ], 1420, 1.0
[READ], 1422, 1.0
[READ], 1424, 1.0
[READ], 1432, 1.0
[READ], 1436, 1.0
[READ], 1441, 2.0
[READ], 1442, 1.0
[READ], 1443, 1.0
[READ], 1445, 1.0
[READ], 1454, 1.0
[READ], 1456, 1.0
[READ], 1473, 1.0
[READ], 1477, 1.0
[READ], 1505, 1.0
[READ], 1512, 1.0
[READ], 1525, 1.0
[READ], 1561, 1.0
[READ], 1571, 1.0
[READ], 1577, 1.0
[READ], 1591, 1.0
[READ], 1594, 1.0
[READ], 1616, 1.0
[READ], 1624, 1.0
[READ], 1630, 1.0
[READ], 1661, 1.0
[READ], 1664, 1.0
[READ], 1678, 1.0
[READ], 1694, 1.0
[READ], 1737, 1.0
[READ], 1740, 1.0
[READ], 1772, 1.0
[READ], 1792, 1.0
[READ], 1811, 1.0
[READ], 1817, 1.0
[READ], 1823, 1.0
[READ], 1843, 2.0
[READ], 1858, 1.0
[READ], 1859, 1.0
[READ], 1881, 1.0
[READ], 1885, 1.0
[READ], 1888, 1.0
[READ], 1908, 1.0
[READ], 1963, 1.0
[READ], 1989, 1.0
[READ], 1994, 1.0
[READ], 1998, 1.0
[READ], 2027, 1.0
[READ], 2043, 1.0
[READ], 2065, 1.0
[READ], 2147, 1.0
[READ], 2187, 1.0
[READ], 2197, 1.0
[READ], 2223, 1.0
[READ], 2261, 1.0
[READ], 2307, 1.0
[READ], 2317, 1.0
[READ], 2325, 1.0
[READ], 2335, 1.0
[READ], 2387, 1.0
[READ], 2447, 1.0
[READ], 2695, 1.0
[READ], 2713, 1.0
[READ], 2831, 1.0
[READ], 2855, 1.0
[READ], 2885, 1.0
[READ], 2975, 1.0
[READ], 2993, 1.0
[READ], 3061, 1.0
[READ], 3071, 1.0
[READ], 3081, 1.0
[READ], 3093, 1.0
[READ], 3179, 1.0
[READ], 3247, 1.0
[READ], 3329, 1.0
[READ], 3549, 1.0
[READ], 3615, 1.0
[READ], 3651, 1.0
[READ], 3755, 1.0
[READ], 3761, 1.0
[READ], 3849, 1.0
[READ], 4243, 1.0
[READ], 4423, 1.0
[READ], 4567, 1.0
[READ], 4635, 1.0
[READ], 5075, 1.0
[READ], 5383, 1.0
[READ], 5527, 1.0
[READ], 5859, 1.0
[READ], 5899, 1.0
[READ], 6071, 1.0
[READ], 6947, 1.0
[READ], 7571, 1.0
[READ], 7831, 1.0
[READ], 8007, 1.0
[READ], 9511, 1.0
[READ], 11935, 1.0
[READ], 16911, 1.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3647.0
[CLEANUP], MinLatency(us), 3646
[CLEANUP], MaxLatency(us), 3647
[CLEANUP], 95thPercentileLatency(us), 3647
[CLEANUP], 99thPercentileLatency(us), 3647
[CLEANUP], 3647, 1.0
[UPDATE], Operations, 64
[UPDATE], AverageLatency(us), 804.484375
[UPDATE], MinLatency(us), 281
[UPDATE], MaxLatency(us), 6043
[UPDATE], 95thPercentileLatency(us), 1929
[UPDATE], 99thPercentileLatency(us), 4163
[UPDATE], Return=OK, 64
[UPDATE], 281, 1.0
[UPDATE], 298, 1.0
[UPDATE], 315, 1.0
[UPDATE], 338, 1.0
[UPDATE], 350, 1.0
[UPDATE], 353, 1.0
[UPDATE], 367, 1.0
[UPDATE], 372, 1.0
[UPDATE], 380, 1.0
[UPDATE], 394, 1.0
[UPDATE], 401, 1.0
[UPDATE], 409, 1.0
[UPDATE], 421, 1.0
[UPDATE], 422, 1.0
[UPDATE], 432, 1.0
[UPDATE], 445, 1.0
[UPDATE], 450, 1.0
[UPDATE], 455, 1.0
[UPDATE], 458, 1.0
[UPDATE], 469, 1.0
[UPDATE], 481, 1.0
[UPDATE], 501, 1.0
[UPDATE], 518, 1.0
[UPDATE], 525, 1.0
[UPDATE], 526, 1.0
[UPDATE], 527, 1.0
[UPDATE], 532, 1.0
[UPDATE], 555, 1.0
[UPDATE], 556, 1.0
[UPDATE], 558, 1.0
[UPDATE], 560, 1.0
[UPDATE], 574, 1.0
[UPDATE], 588, 1.0
[UPDATE], 615, 1.0
[UPDATE], 618, 1.0
[UPDATE], 628, 1.0
[UPDATE], 635, 2.0
[UPDATE], 636, 1.0
[UPDATE], 638, 1.0
[UPDATE], 649, 1.0
[UPDATE], 669, 1.0
[UPDATE], 704, 1.0
[UPDATE], 718, 2.0
[UPDATE], 759, 1.0
[UPDATE], 770, 1.0
[UPDATE], 781, 1.0
[UPDATE], 803, 1.0
[UPDATE], 818, 1.0
[UPDATE], 879, 1.0
[UPDATE], 882, 1.0
[UPDATE], 914, 1.0
[UPDATE], 925, 1.0
[UPDATE], 948, 1.0
[UPDATE], 1044, 1.0
[UPDATE], 1090, 1.0
[UPDATE], 1173, 1.0
[UPDATE], 1390, 1.0
[UPDATE], 1492, 1.0
[UPDATE], 1929, 1.0
[UPDATE], 2012, 1.0
[UPDATE], 4163, 1.0
[UPDATE], 6043, 1.0